today.org
#+setupfile: org/info/index-bigblow-header.setup
#+include: org/info/common-header.org
#+AUTHOR: 鈴木正幸，非常勤講師
#+title: 10/18 RforS (データ解析) 
#+OPTIONS:
#+property: header-arg:R :session t :results output :exports both

* 10/18 02回目の講義内容

** 関連

*** Doing このページ

    [[https://github.com/masayuki054/RforS/blob/main/today.org][RforS/today.org at main · masayuki054/RforS · GitHub]]

    - 今日のオンライン講義の説明の流れです。
    - Emacs org-mode で書いています。
      - [[http://misohena.jp/blog/2017-10-26-how-to-use-code-block-of-emacs-org-mode.html#lang-r][org-modeのコードブロック(Babel)の使い方 | Misohena Blog]]
    - github からダウンロード可能です。
    - ~suzuki/public_html/stat2 からもアクセスできます。

*** Done 講義ノート
    CLOSED: [2021-10-18 月 09:45]
    [[https://drive.google.com/drive/u/0/folders/1nGs6svr0actrLPmtz6onPuj2eUrHMQ8M][note - Google ドライブ]]
    - 板書用の手書きノート 

*** Done Rに関すること
    - [[./org/R-info.org]]
    - [[http://cse.naro.affrc.go.jp/takezawa/r-tips.pdf][R-Tips - r-tips.pdf]]
    - [[http://www.okadajp.org/RWiki/?R%E3%81%AE%E5%9F%BA%E6%9C%AC%E3%83%91%E3%83%83%E3%82%B1%E3%83%BC%E3%82%B8%E4%B8%AD%E3%81%AE%E7%A2%BA%E7%8E%87%E5%88%86%E5%B8%83%E3%80%81%E4%B9%B1%E6%95%B0%E9%96%A2%E6%95%B0%E4%B8%80%E8%A6%A7][Rの基本パッケージ中の確率分布、乱数関数一覧 - RjpWiki]] 

*** Done 参考書
    - [[http://whitewell.sakura.ne.jp/R/][Webpage for Probability Theory and Statistics (B)]] 
      - 中京大 白井先生, Rによるやさしい統計学

    - [[http://www.cc.aoyama.ac.jp/~t41338/lecture/aoyama/stat2e/stat2e_top.html][社会統計演習]] (青山大学)
      - Rによるやさしい統計学の動画による解説

   - [[https://www.ohmsha.co.jp/book/9784274227387/][入門 統計学（第2版） 検定から多変量解析・実験計画法・ベイズ統計学まで | Ohmsha]]
     - 絵が豊富
  
*** 2冊の教科書と進行

    確率と統計
    - K: 進行 K-7, K-5, K-8, K-10, K-11, K-12

    Rによるやさしい統計学
    - R: (R-4, R-5, R-6, R-7)， (R-8, R-9)

    対応
    - 標本と統計的推測 K-7:R-4
    - 大数の法則と中心極限定理 K-5:R-4
    - 点推定 K-8: (R-4, R-5)
    - 区間推定 K-10:R-4
    - 検定 K-11, R-5
    - いろいろな検定 K-12:(R-6, R-7)
    

    
*** Done 気をつけること

   - 講義ノート・教科書を読んでもらってから，説明すること

   - プログラムは説明してから，入力の時間をとり，その後説明しながら実行
     すること

*** Done 分布表

    R が使えないときに，確率計算に使ってください。
   
    - [[http://www3.u-toyama.ac.jp/kkarato/2019/statistics/table/z.pdf][標準正規分布配布用 - z.pdf]]
    - [[http://www3.u-toyama.ac.jp/kkarato/2019/statistics/table/t.pdf][t分布 - t.pdf]]
    - [[http://www3.u-toyama.ac.jp/kkarato/2019/statistics/table/chisq.pdf][CHISQ-TABLE.docx - chisq.pdf]]
    - [[http://www3.u-toyama.ac.jp/kkarato/2019/statistics/table/F.pdf][Fs - F.pdf]]
   

** 今日 (10/18) の流れ
*** 講師のRノート

    - [[./org/RforS-II-index.org]]    

   
*** Doing Rの環境
    
**** Todo Rの実行環境 
     
     - Rstudio がいいかもしれません

     - 作業用のフォルダを準備し，スクリプトやデータの読み込み，保存がで
       きること

       ： ~/stat2/R Rの実行フォルダと想定します。
       ： ~/stat2/R/data の下にデータがあると想定します。

**** Done データの準備
     
     - [[http://www.cc.aoyama.ac.jp/~t41338/lecture/aoyama/stat2e/stat2e_top.html][社会統計演習]] (青山大学) からデータをダウンロードしてください。
       漢字コードの違う二つの圧縮ファイルがあります，utf-8 のものを
       ダウンロードしてください。

       ： ~/stat2/R/data とかに配置してください。
       
**** Todo R markdown
     SCHEDULED: <2021-10-18 月>

     文書とRスクリプトを共存させることができるはずです。

     参考サイト: [[https://kazutan.github.io/kazutanR/Rmd_intro.html][R Markdown入門]], [[https://qiita.com/tomotagwork/items/c92fb40a76f56ea16aa4][R Markdownによるレポート生成 - Qiita]]
     - コースの計算機には，pandoc がインストールされていない。

     
*** Doing 標本と統計的推測

   先週も参照した，[[http://whitewell.sakura.ne.jp/R/Rstatistics-03.html][Rで統計学を学ぶ(3)]] です

    - 講師の R 実行環境 は，[[./org/RforS-II-04.org]] です。
    - 教科書では，主に7章，5章になります。
    - 昨年の講義ノート [[https://drive.google.com/drive/folders/1vFIqux3NytwvUEygZ74O9XzuyCoJfj7D][lect-note - Google ドライブ]]  の7章，5章も関係し
      ます。

    - 前期の内容では，下記内容が関係します：

      - 確率変数と確率分布
      - 確率変数の和の平均と分散


     

    
